rewardEvaluation/run/cylinder/Random_walk/DRL_signal/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     pimpleFoam;

startFrom       startTime;

startTime       3.99;

stopAt          endTime;

endTime         12;

deltaT          0.0005;

writeControl    runTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

timeFormat      general;

timePrecision   8;

runTimeModifiable false;

functions
{
    forces
    {
        type            forceCoeffs;
        libs            ( forces );
        writeControl    timeStep;
        writeInterval   1;
        log             false;
        patches         ( cylinder );
        rhoInf          1;
        rho             rhoInf;
        CofR            ( 0.2 0.2 0.005 );
        liftDir         ( 0 1 0 );
        dragDir         ( 1 0 0 );
        magUInf         1;
        lRef            0.1;
        Aref            0.001;
    }
}


// ************************************************************************* //
